Revit 2024 API
DocumentChangedEventArgs.GetAddedElementIds Method
Overload List
Name | Description
GetAddedElementIds()
 Returns set of elements newly added to the document.
GetAddedElementIds(ElementFilter)
 Returns set of newly added elements that pass the filter.
See Also
DocumentChangedEventArgs Class
DocumentChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace